#矩陣，就是指多個陣列的混合
#二維陣列

x = [1,2,3,4,5]
y = ["小明", "小華", "山本"]

#陣列是一排座位
#矩陣是電影院的集合座位（一排一排）

#二維陣列（矩陣），多個陣列的組成，電影院座椅
#集合，蒐集類似的資訊
xx = [
["小明", "小華", "山本"],
["1明", "1華", "1本"],
["2明", "2華", "2本"],
["3明", "3華", "3本"],
["4明", "4華", "4本"]]

print(xx)

##他跟字典差在哪
#字典是鍵對值，對子
dic = {"小明":17, "孝華":55}
print(dic["小明"])


xx = [
["小明", "小華", "山本"],
["1明", "1華", "1本"],
["2明", "2華", "2本"],
["3明", "3華", "3本"],
["4明", "4華", "4本"]]

#台北車站 #西門 #南港展覽館 ＃東京
mappp_distance = [
    [0,4,8,-999], #台北車站
    [4,0,11,-999],
    [8,11,0,-999],
    [-999,-999,-999,0]
]
# 是否存在
# mapp_can_reach = [
#     [1,0,......]
# ]


#矩陣的取值
xx = [
["小明", "小華", "山本"],
["1明", "1華"],
["2明", "2華", "2本"],
["3明", "3華", "3本"],
["4明", "4華", "4本","翔平"]
]

# 取值 
# 陣列名[電梯樓層][房間]
print(xx[0][1])
print(xx[3][2])

print(xx[4][0])

#如何修改裡面的值
xx[0][2] = "朗希"
print(xx)

#矩陣的大小
rows = len(xx) #有幾樓
col = len(xx[1]) #那一樓有幾個房間

#取大小
get_max = max(xx[4])

print(rows)
print(col)






