# 6 7月-->考APCS-->Ｘ

#陣列-->array-->串列

#跟本邏輯-->連續記憶體空間-->資料是彼此相鄰的
#『相關』

#數字型陣列
x = [1,2,3,4,5]

print(x[3]) #取出4，這個[3]叫做索引值

#字串型陣列
y = ["佐助","卡卡西","佩恩","鳴人"]

print(y[3])
# y[-1] -->把最後一個取出來
print(y) # --> 所有陣列裡面的東西印出來

#布林型陣列
u = [True, False, True]



#####========================================#####

#迴圈-->做重複的事情-->減少冗餘的程式碼

#深度理解迴圈運作
#yyds會印出0 1 2 3 4 5-->沒有6
# for yyds in range(6):
#     print(yyds)

#理解range(i)-->它的作用是產生一個『0~i-1』的陣列
#range(8)-->[0,1,2,3,4,5,6,7]
#range(1)-->[0]
#理解range(p,i)-->兩個數字-->它的作用是產生一個『p~i-1』的陣列
#range(2,7)-->[2,3,4,5,6]
#range(5,9)-->[5,6,7,8]

########重點在這############
#口訣：尾巴減一，頭不用，沒指定從0開始
#核心概念：for i in xxx --> i 『輪流當』 xxx裡面，每一個數字，成員
########重點在這############

# for yyds in range(100):
#     print(520)

y = ["佐助","卡卡西","佩恩","鳴人"]

# 印出y裡面所有名字，因為y會去當陣列裡面每個元素。
for i in y:
    print(i)


###陣列的運用####
x = [1,2,3,4,5,6,7,8,9,10]
# sum()
# max()
# min()


#一維陣列
d_array = [1,2,3,4,5,6]

print(d_array[1]) #2

#二維陣列
dd_array = [[1,2,3], 
            [4,5,6], 
            [7,8,9],
            [11,77,88,99,44]
            ]

print(dd_array[1]) #[4,5,6]
print(dd_array[0]) #[1,2,3]
#要怎麼，取出單一個數字。
# 取出8
print(dd_array[2]) #[7,8,9]
print(dd_array[3][0]) #8







####### APCS split() 必考-->用於分割陣列
# split()
# 記得～～剛輸入都是字串，必須把它轉成數字
# 我自己會用x = [int(i) for i in x]來轉換
# 如果程式比較多，型態可以用type(變數)確認-->他會印出型態



    