# 1. 我會不會接收輸入，建構二維陣列。

#APCS請你建構二維陣列，有兩種方式：

#【第一種題目】，我給你Ｒ＊Ｃ，建構出乾淨的陣列。
# R = 4 , C = 5
# 0000   
# 0000       
# 0000      
# 0000    
# 0000    

# R=5, C=4
# 00000
# 00000      
# 00000     
# 00000

#5 4
# x = input().split() #["5", "4"]
# R = int(x[0]) # 5
# C = int(x[1]) # 4

# test = [0]*3 #[0, 0, 0]

# grid = [[0]* R for _ in range(C)]
# # [0]* R 建構出一個row有幾個0 --> [0,0,0,0,0]
# # range(C)代表重複C次
# print(grid)



#【第一種題目】，給你Ｒ跟Ｃ，但我也指定內容
# 3 4
# 1 2 3
# 4 4 4
# 6 6 6
# 8 8 8
R, C = map(int, input().split())
# input().split() --> ["3", "4"]
#map --> 我對陣列裡面每一個人，都做int() --> # 3 4
grid = [list(map(int, input().split())) for _ in range(C)]
#每次切分陣列-->list(map(int, input().split()))-->list把切分後的結果轉成陣列
#for _ in range(C)-->重複Ｃ次，用以接收使用者的輸入


# [[1, 2, 3, 4], 
#  [4, 5, 6, 7], 
#  [7, 7, 7, 7]]
# -->
# 1 2 3 4 
# 4 5 6 7 
# 7 7 7 7

for i in grid:
    print(*i)













